% Амплитуда импульса
Amp = 10^9;
% Размерность преобразования Фурье для построения спектров
N_FFT = 2^20;
% Параметр для построения импульса
alfa = 3*10^(-22);
% Длительность импульса
T = 500*10^(-12);
% Шаг по времени
dt = T/20;
% Отсчёты по времени
t0 = -T/2 + dt/2 : dt : T/2 - dt/2;
% Частота дискретизации
Fd = 1/dt;

% Количество усреднений
N_Average_Error_Prob = 1;

% Отношение сигнал-шум
SNR = 1004.32;

% Длина преамбулы
L_Preamble = 10^3;% Массив для хранения преамбулы
Preamble_arr = ones(1, L_Preamble);

% Режим модуляции
Mod_Regim = 0;
switch Mod_Regim
    case 0
        % Модуляция "сигнал есть/нет"
        % Порог принятия решения по текущему принятому биту
        disp('Выбрана схема модуляции "сигнал есть/нет"');
        Porog_Value = 0.5;
    case 1
        % Модуляция переворотом импульса
        % Порог принятия решения по текущему принятому биту
        disp('Выбрана схема модуляции "инвертированием импульса"');
        Porog_Value = 0;
end
